; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite1 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite2 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite3 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite4 - satellite
	instrument16 - instrument
	instrument17 - instrument
	satellite5 - satellite
	instrument18 - instrument
	instrument19 - instrument
	satellite6 - satellite
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	spectrograph2 - mode
	image0 - mode
	image4 - mode
	infrared3 - mode
	spectrograph1 - mode
	groundstation13 - direction
	star10 - direction
	groundstation14 - direction
	groundstation8 - direction
	star6 - direction
	groundstation5 - direction
	groundstation0 - direction
	groundstation3 - direction
	groundstation2 - direction
	groundstation9 - direction
	groundstation11 - direction
	star4 - direction
	star1 - direction
	groundstation7 - direction
	groundstation15 - direction
	groundstation12 - direction
	planet16 - direction
	star17 - direction
	phenomenon18 - direction
	star19 - direction
	phenomenon20 - direction
	planet21 - direction
	planet22 - direction
	star23 - direction
	planet24 - direction
	star25 - direction
	planet26 - direction
	star27 - direction
	planet28 - direction
	phenomenon29 - direction
	planet30 - direction
	phenomenon31 - direction
	planet32 - direction
	phenomenon33 - direction
	planet34 - direction
	star35 - direction
	star36 - direction
	phenomenon37 - direction
	planet38 - direction
	star39 - direction
	phenomenon40 - direction
	planet41 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 groundstation5)
	(calibration_target instrument0 groundstation14)
	(calibration_target instrument0 groundstation9)
	(supports instrument1 infrared3)
	(supports instrument1 image4)
	(calibration_target instrument1 groundstation3)
	(calibration_target instrument1 groundstation11)
	(calibration_target instrument1 groundstation7)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 groundstation14)
	(calibration_target instrument2 star1)
	(calibration_target instrument2 groundstation2)
	(calibration_target instrument2 star6)
	(supports instrument3 image0)
	(calibration_target instrument3 groundstation2)
	(calibration_target instrument3 groundstation9)
	(supports instrument4 image4)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 groundstation0)
	(calibration_target instrument4 groundstation8)
	(calibration_target instrument4 groundstation12)
	(calibration_target instrument4 star6)
	(calibration_target instrument4 groundstation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(power_avail satellite0)
	(pointing satellite0 groundstation7)
	(supports instrument5 infrared3)
	(calibration_target instrument5 groundstation13)
	(calibration_target instrument5 groundstation3)
	(supports instrument6 spectrograph1)
	(supports instrument6 image4)
	(calibration_target instrument6 groundstation12)
	(calibration_target instrument6 groundstation15)
	(calibration_target instrument6 groundstation3)
	(calibration_target instrument6 groundstation8)
	(calibration_target instrument6 groundstation5)
	(supports instrument7 spectrograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 groundstation14)
	(calibration_target instrument7 groundstation5)
	(calibration_target instrument7 groundstation11)
	(calibration_target instrument7 star6)
	(supports instrument8 image0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 groundstation2)
	(calibration_target instrument8 groundstation5)
	(calibration_target instrument8 star4)
	(supports instrument9 infrared3)
	(calibration_target instrument9 groundstation0)
	(calibration_target instrument9 groundstation11)
	(calibration_target instrument9 groundstation2)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(on_board instrument8 satellite1)
	(on_board instrument9 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet41)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph1)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 groundstation5)
	(calibration_target instrument10 star10)
	(calibration_target instrument10 groundstation0)
	(calibration_target instrument10 groundstation7)
	(supports instrument11 infrared3)
	(supports instrument11 image4)
	(calibration_target instrument11 groundstation14)
	(calibration_target instrument11 groundstation12)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(power_avail satellite2)
	(pointing satellite2 groundstation9)
	(supports instrument12 spectrograph1)
	(supports instrument12 image0)
	(calibration_target instrument12 star4)
	(calibration_target instrument12 star6)
	(supports instrument13 image0)
	(calibration_target instrument13 groundstation2)
	(calibration_target instrument13 star4)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 groundstation3)
	(calibration_target instrument14 star1)
	(calibration_target instrument14 groundstation8)
	(calibration_target instrument14 groundstation14)
	(supports instrument15 spectrograph1)
	(supports instrument15 image0)
	(calibration_target instrument15 star6)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(on_board instrument15 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon37)
	(supports instrument16 spectrograph1)
	(calibration_target instrument16 groundstation2)
	(calibration_target instrument16 star1)
	(calibration_target instrument16 groundstation5)
	(supports instrument17 image4)
	(supports instrument17 infrared3)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 groundstation0)
	(calibration_target instrument17 star1)
	(calibration_target instrument17 groundstation9)
	(calibration_target instrument17 groundstation7)
	(calibration_target instrument17 star4)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon31)
	(supports instrument18 image0)
	(supports instrument18 infrared3)
	(calibration_target instrument18 groundstation9)
	(supports instrument19 image0)
	(supports instrument19 spectrograph2)
	(calibration_target instrument19 groundstation15)
	(calibration_target instrument19 groundstation7)
	(on_board instrument18 satellite5)
	(on_board instrument19 satellite5)
	(power_avail satellite5)
	(pointing satellite5 groundstation15)
	(supports instrument20 infrared3)
	(supports instrument20 image0)
	(calibration_target instrument20 groundstation2)
	(calibration_target instrument20 groundstation7)
	(calibration_target instrument20 groundstation3)
	(supports instrument21 spectrograph1)
	(calibration_target instrument21 groundstation11)
	(calibration_target instrument21 groundstation7)
	(calibration_target instrument21 groundstation9)
	(supports instrument22 spectrograph1)
	(supports instrument22 infrared3)
	(supports instrument22 image4)
	(calibration_target instrument22 groundstation12)
	(calibration_target instrument22 groundstation15)
	(calibration_target instrument22 groundstation7)
	(calibration_target instrument22 star1)
	(calibration_target instrument22 star4)
	(on_board instrument20 satellite6)
	(on_board instrument21 satellite6)
	(on_board instrument22 satellite6)
	(power_avail satellite6)
	(pointing satellite6 groundstation3)
)
(:goal (and
	(pointing satellite1 planet28)
	(pointing satellite4 planet16)
	(pointing satellite5 star17)
	(have_image planet16 infrared3)
	(have_image star17 spectrograph2)
	(have_image phenomenon18 spectrograph1)
	(have_image star19 image4)
	(have_image phenomenon20 spectrograph1)
	(have_image planet21 spectrograph1)
	(have_image planet22 spectrograph2)
	(have_image star23 image0)
	(have_image planet24 spectrograph1)
	(have_image planet26 image0)
	(have_image planet28 image0)
	(have_image phenomenon29 spectrograph2)
	(have_image planet30 image4)
	(have_image phenomenon31 spectrograph2)
	(have_image planet32 image0)
	(have_image planet34 image4)
	(have_image star36 image4)
	(have_image phenomenon37 spectrograph1)
	(have_image planet38 spectrograph2)
	(have_image star39 spectrograph2)
	(have_image phenomenon40 infrared3)
	(have_image planet41 infrared3)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite1 planet28 planet41)
   deleted: (pointing satellite1 planet41)
   added: (pointing satellite1 planet28)
   goals met: 1 of 25
2. (turn_to satellite4 planet16 phenomenon31)
   deleted: (pointing satellite4 phenomenon31)
   added: (pointing satellite4 planet16)
   goals met: 2 of 25
3. (turn_to satellite5 star17 groundstation15)
   deleted: (pointing satellite5 groundstation15)
   added: (pointing satellite5 star17)
   goals met: 3 of 25
4. (switch_on instrument4 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument4)
   goals met: 3 of 25
5. (calibrate satellite0 instrument4 groundstation7)
   added: (calibrated instrument4)
   goals met: 3 of 25
6. (turn_to satellite0 phenomenon18 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon18)
   goals met: 3 of 25
7. (take_image satellite0 phenomenon18 instrument4 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 4 of 25
8. (turn_to satellite0 phenomenon20 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon20)
   goals met: 4 of 25
9. (take_image satellite0 phenomenon20 instrument4 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 5 of 25
10. (turn_to satellite0 phenomenon29 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon29)
   goals met: 5 of 25
11. (take_image satellite0 phenomenon29 instrument4 spectrograph2)
   added: (have_image phenomenon29 spectrograph2)
   goals met: 6 of 25
12. (turn_to satellite0 phenomenon31 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon31)
   goals met: 6 of 25
13. (take_image satellite0 phenomenon31 instrument4 spectrograph2)
   added: (have_image phenomenon31 spectrograph2)
   goals met: 7 of 25
14. (turn_to satellite0 phenomenon37 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 phenomenon37)
   goals met: 7 of 25
15. (take_image satellite0 phenomenon37 instrument4 spectrograph1)
   added: (have_image phenomenon37 spectrograph1)
   goals met: 8 of 25
16. (switch_on instrument20 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument20)
   goals met: 8 of 25
17. (calibrate satellite6 instrument20 groundstation3)
   added: (calibrated instrument20)
   goals met: 8 of 25
18. (turn_to satellite6 phenomenon40 groundstation3)
   deleted: (pointing satellite6 groundstation3)
   added: (pointing satellite6 phenomenon40)
   goals met: 8 of 25
19. (take_image satellite6 phenomenon40 instrument20 infrared3)
   added: (have_image phenomenon40 infrared3)
   goals met: 9 of 25
20. (turn_to satellite6 planet16 phenomenon40)
   deleted: (pointing satellite6 phenomenon40)
   added: (pointing satellite6 planet16)
   goals met: 9 of 25
21. (take_image satellite6 planet16 instrument20 infrared3)
   added: (have_image planet16 infrared3)
   goals met: 10 of 25
22. (turn_to satellite0 planet21 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 planet21)
   goals met: 10 of 25
23. (take_image satellite0 planet21 instrument4 spectrograph1)
   added: (have_image planet21 spectrograph1)
   goals met: 11 of 25
24. (turn_to satellite0 planet22 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet22)
   goals met: 11 of 25
25. (take_image satellite0 planet22 instrument4 spectrograph2)
   added: (have_image planet22 spectrograph2)
   goals met: 12 of 25
26. (turn_to satellite0 planet24 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 planet24)
   goals met: 12 of 25
27. (take_image satellite0 planet24 instrument4 spectrograph1)
   added: (have_image planet24 spectrograph1)
   goals met: 13 of 25
28. (turn_to satellite6 planet26 planet16)
   deleted: (pointing satellite6 planet16)
   added: (pointing satellite6 planet26)
   goals met: 13 of 25
29. (take_image satellite6 planet26 instrument20 image0)
   added: (have_image planet26 image0)
   goals met: 14 of 25
30. (turn_to satellite6 planet28 planet26)
   deleted: (pointing satellite6 planet26)
   added: (pointing satellite6 planet28)
   goals met: 14 of 25
31. (take_image satellite6 planet28 instrument20 image0)
   added: (have_image planet28 image0)
   goals met: 15 of 25
32. (turn_to satellite0 planet30 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet30)
   goals met: 15 of 25
33. (take_image satellite0 planet30 instrument4 image4)
   added: (have_image planet30 image4)
   goals met: 16 of 25
34. (turn_to satellite6 planet32 planet28)
   deleted: (pointing satellite6 planet28)
   added: (pointing satellite6 planet32)
   goals met: 16 of 25
35. (take_image satellite6 planet32 instrument20 image0)
   added: (have_image planet32 image0)
   goals met: 17 of 25
36. (turn_to satellite0 planet34 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet34)
   goals met: 17 of 25
37. (take_image satellite0 planet34 instrument4 image4)
   added: (have_image planet34 image4)
   goals met: 18 of 25
38. (turn_to satellite0 planet38 planet34)
   deleted: (pointing satellite0 planet34)
   added: (pointing satellite0 planet38)
   goals met: 18 of 25
39. (take_image satellite0 planet38 instrument4 spectrograph2)
   added: (have_image planet38 spectrograph2)
   goals met: 19 of 25
40. (turn_to satellite6 planet41 planet32)
   deleted: (pointing satellite6 planet32)
   added: (pointing satellite6 planet41)
   goals met: 19 of 25
41. (take_image satellite6 planet41 instrument20 infrared3)
   added: (have_image planet41 infrared3)
   goals met: 20 of 25
42. (turn_to satellite0 star17 planet38)
   deleted: (pointing satellite0 planet38)
   added: (pointing satellite0 star17)
   goals met: 20 of 25
43. (take_image satellite0 star17 instrument4 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 21 of 25
44. (turn_to satellite0 star19 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star19)
   goals met: 21 of 25
45. (take_image satellite0 star19 instrument4 image4)
   added: (have_image star19 image4)
   goals met: 22 of 25
46. (turn_to satellite6 star23 planet41)
   deleted: (pointing satellite6 planet41)
   added: (pointing satellite6 star23)
   goals met: 22 of 25
47. (take_image satellite6 star23 instrument20 image0)
   added: (have_image star23 image0)
   goals met: 23 of 25
48. (turn_to satellite0 star36 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star36)
   goals met: 23 of 25
49. (take_image satellite0 star36 instrument4 image4)
   added: (have_image star36 image4)
   goals met: 24 of 25
50. (turn_to satellite0 star39 star36)
   deleted: (pointing satellite0 star36)
   added: (pointing satellite0 star39)
   goals met: 24 of 25
51. (take_image satellite0 star39 instrument4 spectrograph2)
   added: (have_image star39 spectrograph2)
   goals met: 25 of 25
